# Merging and Exporting Data

## Table of contents:

#### - Concatenate, append and merge dataframes

#### - Export merged data using the pickle method

# 01. Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
# Creating path

path = r'/Users/david/Desktop/CF/Data Immersion/Achievement 4 - Python Fundamentals for Data Analysts/07-2022 Instacart Basket Analysis'

In [3]:
# Verifying path

path

'/Users/david/Desktop/CF/Data Immersion/Achievement 4 - Python Fundamentals for Data Analysts/07-2022 Instacart Basket Analysis'

# 02. Methods of Combining Data

### 02.1 Concatenate

In [36]:
# Example to use pd. concat()
# 1. Create dictionaries of data ( to experiment with)
# 2. Convert the dictionaries into dataframes
# 3. Concatenate dataframes

#### 02.1.1 Creating dictionaries of data

In [9]:
# Define a dictionary containing January 2020 data

data1 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'purchased_meat':[0, 13, 3, 4],
    'purchased_alcohol':[1, 2, 10, 0],
    'purchased_snacks':[10, 5, 1, 7]}

In [10]:
data1

{'customer_id': ['6732', '767', '890', '635'],
 'month': ['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
 'purchased_meat': [0, 13, 3, 4],
 'purchased_alcohol': [1, 2, 10, 0],
 'purchased_snacks': [10, 5, 1, 7]}

In [6]:
# Define a dictionary containing February 2020 data

data2 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
    'purchased_meat':[0, 10, 5, 3],
    'purchased_alcohol':[2, 4, 14, 0],
    'purchased_snacks':[15, 3, 2, 6]}

In [8]:
data2

{'customer_id': ['6732', '767', '890', '635'],
 'month': ['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
 'purchased_meat': [0, 10, 5, 3],
 'purchased_alcohol': [2, 4, 14, 0],
 'purchased_snacks': [15, 3, 2, 6]}

#### 02.1.2 Convert dictionaries into dataframes

In [12]:
#Convert the dictionary into dataframe

df_1 = pd.DataFrame(data1,index=[0, 1, 2, 3])
df_2 = pd.DataFrame(data2,index=[0, 1, 2, 3])

# By using the 'pd.DataFrame' function, Python converts dictionaries into dataframes
# The converted object goes along with an 'index' argument, that tell Python to return an index with each dataframe

In [19]:
# Check on 'df_1' and 'df_2'
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [17]:
df_2

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [20]:
# To concatenate these two dataframes:
# 1st, create a list
# 2nd, concatenate this list with the concatenate pandas fucntion: 'pd.concat()'

frames = [df_1, df_2]

In [21]:
# Checking 'frames' list
frames

[  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Jan-20               0                  1                10
 1         767  Jan-20              13                  2                 5
 2         890  Jan-20               3                 10                 1
 3         635  Jan-20               4                  0                 7,
   customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Feb-20               0                  2                15
 1         767  Feb-20              10                  4                 3
 2         890  Feb-20               5                 14                 2
 3         635  Feb-20               3                  0                 6]

In [22]:
# Check the data types to be sure it is a list

type(frames)

list

#### 02.1.3 concatenate dataframes ( 'pd.concat( )' )

In [23]:
# Concatenate the dataframes using default options

df_concat = pd.concat(frames)

In [24]:
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [25]:
# 'pd.concat()' function, stack one dataframe on top of the other by default with a hiden (by default) value defined as 'axis = 0'
# If I wanted to have the dataframes side by side, then I have to specify 'axis = 1' so it can do so

df_concat = pd.concat(frames, axis = 1)

In [26]:
df_concat

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

#### Concatenate works better when/will do/will require:
#### - When columns and rows have the same length
#### - Wil place a list on top of each other ('axis = 0') unless it's specified side-by-side ('axis = 1')
#### - Will require a list as ots main argument

### 02.2 Appending Data

In [ ]:
# Appending approach for when rows of a dataframe want to be added into another dataframe with the same number of columns
# The 'append()' function works sthe same as 'pd.concat()', as it stacks one dataframe on the other by default ('axis = 0') unless specified different ('axis = 1')
# The rows of 1 or more dataframes can be added, and for that we need to create a list within the parenthesis in 'append()'

In [27]:
# Append 'df_1' and 'df_2'

df_append = df_1.append(df_2)

/var/folders/jw/m4xyglrx2lzdcm7rs6z302nm0000gn/T/ipykernel_1643/577814125.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_append = df_1.append(df_2)

In [28]:
# Take in consideration the message above: 
# /var/folders/jw/m4xyglrx2lzdcm7rs6z302nm0000gn/T/ipykernel_1643/577814125.py:3: FutureWarning: 
# The frame.append method is deprecated and will be removed from pandas in a future version. 
# Use pandas.concat instead.
# df_append = df_1.append(df_2)

df_append

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [29]:
# What happens when appending a dataframe with different amount of columns?
# Create data with different columns from df

data3 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'days_purchased_on':[0, 13, 3, 4]}

In [30]:
# Checking 'data3'

data3

{'customer_id': ['6732', '767', '890', '635'],
 'month': ['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
 'days_purchased_on': [0, 13, 3, 4]}

In [33]:
# Converting 'data3' to dataframe
df_3 = pd.DataFrame(data3,index=[0, 1, 2, 3])

In [34]:
# Checking 'df_3'

df_3

  customer_id   month  days_purchased_on
0        6732  Jan-20                  0
1         767  Jan-20                 13
2         890  Jan-20                  3
3         635  Jan-20                  4

In [35]:
# 'append()' function to append df_2 onto df and check the output:

df_append_test = df_1.append(df_3)

/var/folders/jw/m4xyglrx2lzdcm7rs6z302nm0000gn/T/ipykernel_1643/2675509800.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_append_test = df_1.append(df_3)

In [43]:
df_append_test

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0.0,1.0,10.0,NaN
1,767,Jan-20,13.0,2.0,5.0,NaN
2,890,Jan-20,3.0,10.0,1.0,NaN
3,635,Jan-20,4.0,0.0,7.0,NaN
0,6732,Jan-20,NaN,NaN,NaN,0.0
1,767,Jan-20,NaN,NaN,NaN,13.0
2,890,Jan-20,NaN,NaN,NaN,3.0
3,635,Jan-20,NaN,NaN,NaN,4.0

### 02.3 Joining Data

In [37]:
# The 'df.join()'' function is typically only used in cases where your index column carries some sort of information 
# (rather than simply displaying the number of rows, as in your Instacart data

### 02.4 Merging Data

In [38]:
# A good approach for whne the dataframes are different in size.
# A key or a common identifier is needed to merge the dataframes (same logic as in Excel or SQL)
# There are similar types of joins as in SQL:
#   1. Inner join. It only joins data that intersects in between both dataframes (key/commo identifier)
#   2. Left Join. Merges all data in left dataframe and takes the data from the right dataframe that maps back to the left dataframe
#   3. Right Join. merges all the data in the right dataframe and takes the data from the left dataframe that maps back to the right dataframe
#   4. Full Outer Join. It merges all the data from both dataframes, though, the dataframes have to match in size, otherwise a lot of data will be lost in the merged dataframe

In [41]:
# What if merge 'df_1' and 'df_3' dataframes, and set the on argument to pivot around a common column between the two, “customer_id”?

df_merged = df_1.merge(df_3, on = 'customer_id')

In [42]:
# Check 'df_merged' dataframe

df_merged

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on
0,6732,Jan-20,0,1,10,Jan-20,0
1,767,Jan-20,13,2,5,Jan-20,13
2,890,Jan-20,3,10,1,Jan-20,3
3,635,Jan-20,4,0,7,Jan-20,4

##### It takes one dataframe 'df_1' and combines it with another dataframe, which it's included within the parentheses 'df_2'.
##### The addition of the on = customer_id column tells pandas that the “customer_id” column is the common column between the two.

In [45]:
# There are two months columns because the 'month_x' and 'month_y' columns weren't specified as keys

df_merged = df_1.merge(df_3, on = ['customer_id', 'month'])

In [46]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,13
2,890,Jan-20,3,10,1,3
3,635,Jan-20,4,0,7,4

In [49]:
# What happens when there are keys that are not contained on both of the dataframes that are being merged?
# An indicator column can be added to the merged dataframe to indicate  with 'both', 'left_only' or 'right_only' where the key is contained

df_merged = df_1.merge(df_3, on = ['customer_id', 'month'], indicator = True)

In [50]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,13,both
2,890,Jan-20,3,10,1,3,both
3,635,Jan-20,4,0,7,4,both

In [52]:
# What's the frequency or number of values that are in both dataframes or only in the right or left dataframes?
# run a frequency on '_merge'
df_merged['_merge'].value_counts()

both          4
left_only     0
right_only    0
Name: _merge, dtype: int64

In [54]:
# Test merge without overwriting, if I just want to test the new_dataframe instead of overwriting it

pd.merge(df_1,df_3, on = ['customer_id', 'month'], indicator = True)

# Here, the merge is simply being tested and the results displayed without actually creating the new dataframe.

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,13,both
2,890,Jan-20,3,10,1,3,both
3,635,Jan-20,4,0,7,4,both

In [ ]:
# Be aware of when using the df.merge() function: the how argument
# Specifies how to merge the dataframes, and it can take the values 'left', 'right', 'inner (default)'', or 'outer'

# 03. Merging Instacart Data

In [55]:
# The script was written in another notebook called:
# '4.6 Combining & Exporting Data (Lesson-Merging df_ords & df_prods)'

# The main questions you’ll want to ask yourself before choosing a combination method include:

### - How many rows and columns do the dataframes you want to combine contain? Do they have the same number of columns?
### - Do the dataframes contain information on the same subject? Do they share a common column or columns?
### - Should your combined dataframe be long format or wide format?
### - Do you expect a full match after combining the dataframes?
### - If not, what type of join should you use? Which part of the data should you keep in the final dataframe?